---
type: FilterNumericEquals
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# FilterNumericEquals

`Autodesk.Revit.DB.FilterNumericEquals` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FilterNumericEquals | 2011 | `public FilterNumericEquals ()` |
| Method | Evaluate | — | `` |